app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("content", "created_at", "email", "name", "pwd", "role", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)